# Greate Learning

In [1]:
import pandas as pd
import numpy as np

In [24]:
df = pd.read_csv('monthly/monthly.csv')

In [25]:
df

        Date     Price
0    1950-01    34.730
1    1950-02    34.730
2    1950-03    34.730
3    1950-04    34.730
4    1950-05    34.730
..       ...       ...
842  2020-03  1593.764
843  2020-04  1680.030
844  2020-05  1715.697
845  2020-06  1734.032
846  2020-07  1840.807

[847 rows x 2 columns]

In [7]:
df2 = pd.DataFrame(np.random.randint(0,10,size=(4,4)),columns=['col_one','col_two','col_three','col_four'], index=['A','B','C','D'])

# How to create a series

In [8]:
sr = pd.Series([1,2,3,4,5,])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
df.head()

      Date  Price
0  1950-01  34.73
1  1950-02  34.73
2  1950-03  34.73
3  1950-04  34.73
4  1950-05  34.73

In [10]:
df.shape

(847, 2)

# Some parameters while changing string to date

In [11]:
pd.to_datetime('2-3-2022', dayfirst=True)

Timestamp('2022-03-02 00:00:00')

In [12]:
pd.to_datetime('2015-12-1',format = '%Y-%m-%d')

Timestamp('2015-12-01 00:00:00')

In [13]:
# df.Date = 
df.Date = pd.to_datetime(df.Date)

In [14]:
df.head()

        Date  Price
0 1950-01-01  34.73
1 1950-02-01  34.73
2 1950-03-01  34.73
3 1950-04-01  34.73
4 1950-05-01  34.73

In [15]:
df.Date = df.Date.astype('datetime64')

In [16]:
df.dtypes

Date     datetime64[ns]
Price           float64
dtype: object

In [17]:
df.Date = df.Date.dt.strftime('%d-%m-%Y')

In [18]:
df

           Date     Price
0    01-01-1950    34.730
1    01-02-1950    34.730
2    01-03-1950    34.730
3    01-04-1950    34.730
4    01-05-1950    34.730
..          ...       ...
842  01-03-2020  1593.764
843  01-04-2020  1680.030
844  01-05-2020  1715.697
845  01-06-2020  1734.032
846  01-07-2020  1840.807

[847 rows x 2 columns]

# String Methods

In [21]:
df.head()

         Date  Price
0  01-01-1950  34.73
1  01-02-1950  34.73
2  01-03-1950  34.73
3  01-04-1950  34.73
4  01-05-1950  34.73

In [ ]:
df['Date,Price']

In [ ]:
df.columns = ['Date']

In [ ]:
df.Price = df.Date.str.split(',').str.get(1)

In [ ]:
df.Date = df.Date.str.split(',').str.get(0)

In [ ]:
df2 = df

# Save to a file without index

In [ ]:
df.to_csv('monthly/monthly.csv', index=False)

In [47]:
df = pd.read_csv('monthly/monthly.csv')

In [48]:
df.head()

      Date  Price
0  1950-01  34.73
1  1950-02  34.73
2  1950-03  34.73
3  1950-04  34.73
4  1950-05  34.73

In [49]:
df.Date = pd.to_datetime(df.Date, format='%Y-%m')

In [50]:
df1 = df

In [51]:
df1 = df1.drop('Price', axis = 1)

In [52]:
df1.loc[0,'Date'] = '1960-10'

In [53]:
df1.head()

        Date
0 1960-10-01
1 1950-02-01
2 1950-03-01
3 1950-04-01
4 1950-05-01

In [34]:
df1.Date.min()

'01-01-1951'

In [44]:
df.drop(columns='Date', inplace=True)

In [46]:
df1

           Date
0       1960-10
1    01-02-1950
2    01-03-1950
3    01-04-1950
4    01-05-1950
..          ...
842  01-03-2020
843  01-04-2020
844  01-05-2020
845  01-06-2020
846  01-07-2020

[847 rows x 1 columns]

In [4]:
years = [90,91,92,93,94,95]
f1 = {91:8,90:9,92:13,93:8,94:5}
firm1 = pd.Series(f1,index=years)
firm1

90     9.0
91     8.0
92    13.0
93     8.0
94     5.0
95     NaN
dtype: float64

# Replace all types of bad characters from a whole dataframe

In [6]:
data = {'col_1':['[0.123','[0.2424','[1.241','[1.3827','[1.876'],
      'col_2':['**2345','**0.2424','**1.241','**1.3827','**1.876'],
      'col_3':['_2345','_0.2424','_1.241','_1.3827','_1.876'],
      'col_4':['**2345]','0.2424]','1.241]','1.3827]','1.876]'],}
df = pd.DataFrame(data)
df

     col_1     col_2    col_3    col_4
0   [0.123    **2345    _2345  **2345]
1  [0.2424  **0.2424  _0.2424  0.2424]
2   [1.241   **1.241   _1.241   1.241]
3  [1.3827  **1.3827  _1.3827  1.3827]
4   [1.876   **1.876   _1.876   1.876]

In [21]:
df1 = df.replace('[^\d.]', '', regex=True).astype(float)
df1

    col_1      col_2      col_3      col_4
0  0.1230  2345.0000  2345.0000  2345.0000
1  0.2424     0.2424     0.2424     0.2424
2  1.2410     1.2410     1.2410     1.2410
3  1.3827     1.3827     1.3827     1.3827
4  1.8760     1.8760     1.8760     1.8760

In [20]:
df1.dtypes

col_1    float64
col_2    float64
col_3    float64
col_4    float64
dtype: object